In [22]:
import pandas as pd 
import numpy as np

In [2]:
data = pd.read_csv("datasets/income.csv")

In [3]:
data.head()

    Name  Monthly Income ($)
0    Rob                5000
1  Rafiq                6000
2   Nina                4000
3  Sofia                7500
4  Mohan                8000

In [4]:
data

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [5]:
data.describe()

       Monthly Income ($)
count        7.000000e+00
mean         1.433929e+06
std          3.777283e+06
min          4.000000e+03
25%          5.500000e+03
50%          7.000000e+03
75%          7.750000e+03
max          1.000000e+07

In [11]:
data.rename(columns={'Monthly Income ($)': 'income'}, inplace=True)

In [12]:
data.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [18]:
percentile_99 = data.income.quantile(.99)
percentile_99

9400479.999999994

In [19]:
data[data.income>percentile_99]

        Name    income
6  Elon Musk  10000000

In [21]:
data_no_outlier = data[data.income<percentile_99]
data_no_outlier

    Name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [25]:
#Will work for missing value, so change 3rd row to NAN
data['income'][3] = np.nan

/var/folders/2m/c78fd27s08v69jnsf8h09hc00000gn/T/ipykernel_1602/329554937.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['income'][3] = np.nan
/Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages/pandas/core/indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [26]:
data

        Name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [27]:
data.income.mean()

1671666.6666666667

In [28]:
data_new = data.fillna(data.income.mean())
data_new

        Name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [29]:
#meadian gives reasonable value but mean does not. So whenever there is outlier and while filling NaN values, use MEDIAN.
data_new = data.fillna(data.income.median())
data_new

        Name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0